[
    {
        "bookId": "essence-of-karbala",
        "title_ur": "روحِ کربلا",
        "title_en": "The Essence of Karbala",
        "author_ur": "مفتی سجاد",
        "author_en": "Mufti Sajjad",
        "cover_style": "gold-teal",
        "total_chapters": 5,
        "chapters": [
            {
                "chapterId": 1,
                "title_ur": "صبرِ شبر و جرأتِ شبیر",
                "content": [
                    {
                        "type": "urdu_prose",
                        "text": "کربلا کا میدان تاریخ انسانی کا وہ منفرد باب ہے جس نے حق و باطل کے درمیان امتیاز کی لکیر ہمیشہ کے لیے کھینچ دی۔ یہ محض چند افراد کی شہادت کا واقعہ نہیں، بلکہ پوری انسانیت کے لیے آزادی، عزت اور استقامت کا عالمی منشور ہے۔ امام حسین علیہ السلام نے اپنی قربانی سے یہ ثابت کیا کہ جب اصولوں کی بات آئے تو تعداد اور طاقت کوئی معنی نہیں رکھتی۔ آپ نے دس محرم 61 ہجری کو جو مثال قائم کی، وہ قیامت تک آنے والی نسلوں کے لیے مشعل راہ ہے۔ صبر اور استقامت کا وہ معیار جو آپ نے پیش کیا، تاریخ انسانی میں اس کی دوسری مثال نہیں ملتی۔ تین دن کی شدید پیاس، بچوں کا بلکتا ہوا سسکیوں سے بھرا گلا، لیکن حق سے انحراف کی بجائے موت کو گلے لگانا - یہ سب کچھ ایک ایسے درس کی تشکیل کرتا ہے جو انسان کو ذلت کی زندگی کے بجائے عزت کی موت کا تصور دیتا ہے۔"
                    },
                    {
                        "type": "arabic_quote",
                        "text": "إِنْ كَانَ دِينُ مُحَمَّدٍ لَمْ يَسْتَقِمْ إِلَّا بِقَتْلِي يَا سُيُوفُ خُذِينِي",
                        "reference": "امام حسین علیہ السلام"
                    },
                    {
                        "type": "urdu_prose",
                        "text": "امام حسین علیہ السلام نے یزیدی لشکر کے سامنے نہ صرف کلمہ حق بلند کیا، بلکہ اپنے پورے عمل سے یہ ثابت کیا کہ ظلم کے سامنے سینہ سپر ہونا ہی اصل ایمان کی نشانی ہے۔ آپ کا مشہور قول 'ذلت کی زندگی سے عزت کی موت بہتر ہے' آج بھی ہر مظلوم اور محکوم قوم کے لیے نصب العین ہے۔ یہ جملہ محض الفاظ کا مجموعہ نہیں، بلکہ ایک مکمل فلسفہ حیات ہے جو انسان کو یہ سکھاتا ہے کہ عزت و آبرو سب سے بڑی دولت ہے۔ آپ نے ثابت کیا کہ جب حق کی بات ہو تو تنہائی بھی ہجوم سے بہتر ہے، اور اقلیت ہونے کے باوجود باطل کی اکثریت کے سامنے ڈٹ جانا ہی اصل کامیابی ہے۔ یہی وجہ ہے کہ آج بھی کربلا کا ذکر آتے ہی ہر مظلوم کی رگوں میں نیا خون دوڑنے لگتا ہے اور ہر محب اہل بیت کے دل میں انقلاب کی چنگاری سلگنے لگتی ہے۔"
                    },
                    {
                        "type": "persian_poetry",
                        "lines": [
                            "ہر کہ دارد ہوسِ کرب و بلا، بسم اللہ",
                            "ہر کہ دارد سرِ سودائے خدا، بسم اللہ",
                            "در رہِ عشق اگر خونی رگِ جاں گردد",
                            "ہر کہ او عاشقِ شہِ کربلا، بسم اللہ"
                        ]
                    },
                    {
                        "type": "urdu_prose",
                        "text": "امام حسین علیہ السلام کا قیام کسی دنیاوی اقتدار یا حکومت کے حصول کے لیے نہیں تھا۔ بلکہ یہ تو اپنے نانا رسول اللہ صلی اللہ علیہ وآلہ وسلم کے دین کی بقا اور اس کی اصل روح کو زندہ رکھنے کے لیے تھا۔ آپ نے دیکھا کہ بنی امیہ نے اسلام کو محض ایک رسمی مذہب بنا کر رکھ دیا ہے، جبکہ اس کی اصل روح یعنی عدل، انصاف، مساوات اور انسانیت ختم ہوتی جا رہی ہے۔ آپ نے اپنے 72 جانثار ساتھیوں کے ساتھ وہ قربانی پیش کی جس نے نہ صرف اسلام کو نئی زندگی عطا کی، بلکہ دنیا کو یہ بھی سکھایا کہ اصل فتح میدان جنگ میں نہیں، بلکہ تاریخ کے صفحات میں ہوتی ہے۔ آج یزید اور اس کے لشکر کا نام تاریخ کے سیاہ اوراق میں دفن ہے، جبکہ حسین ابن علی کا نام روشن ستاروں کی طرح چمک رہا ہے۔"
                    },
                    {
                        "type": "urdu_prose",
                        "text": "کربلا کی مقدس زمین آج بھی اس پاک لہو کی گواہی دے رہی ہے جو دین حق کی آبیاری کے لیے بہایا گیا۔ ہر ذرہ، ہر کنکر، ہر پتھر پکار پکار کر کہہ رہا ہے کہ حق کی خاطر اپنی جان دینا ہی اصل زندگی ہے۔ یہ زمین اس بات کی گواہ ہے کہ کس طرح بے گناہ بچے پیاس سے تڑپتے رہے، کس طرح خواتین کی عزتیں پامال ہوئیں، لیکن حق کی راہ میں کوئی پسپائی نہیں ہوئی۔ کربلا محض ایک جغرافیائی مقام نہیں، بلکہ ایک فلسفہ ہے، ایک تحریک ہے، ایک انقلاب ہے جو ہر زمانے میں زندہ رہے گا۔ جب تک دنیا میں ظلم ہوگا، کربلا کی روح بیدار رہے گی۔ جب تک انسانی حقوق غصب ہوں گے، حسین کا نعرہ بلند ہوتا رہے گا۔"
                    },
                    {
                        "type": "arabic_quote",
                        "text": "هَيْهَاتَ مِنَّا الذِّلَّةُ",
                        "reference": "امام حسین علیہ السلام"
                    },
                    {
                        "type": "urdu_prose",
                        "text": "یزیدی لشکر کی تعداد اگرچہ ہزاروں میں تھی، لیکن حسینی عزم اور استقلال کے سامنے وہ سب بے بس اور لاچار تھے۔ ان کے پاس ہتھیار تھے، زرق برق لباس تھے، لشکر جرار تھا، لیکن اہل بیت کے پاس صرف ایمان تھا، یقین تھا، اور اللہ پر بھروسہ تھا۔ بھوک اور پیاس کی شدت انتہا کو پہنچ چکی تھی۔ تین دن سے پانی کا ایک قطرہ تک حلق سے نہیں گذرا تھا۔ بچے پیاس سے بلبلاتے تھے، خواتین کی آنکھوں میں آنسو تھے، لیکن زبان پر شکوہ نہ تھا۔ یہی صبر اور استقامت تھی جس نے تاریخ کے دھارے کو موڑ دیا۔ امام حسین علیہ السلام نے اپنے ساتھیوں سے فرمایا: 'تم لوگ مجھے چھوڑ کر چلے جاؤ، میں تنہا ہی کفایت کروں گا'، لیکن کسی نے بھی آپ کو تنہا نہ چھوڑا۔ یہی وفا اور یہی عشق تھا جس نے کربلا کو امر کر دیا۔"
                    },
                    {
                        "type": "persian_poetry",
                        "lines": [
                            "رسمِ شبیریؑ یہی ہے کہ وفادار رہو",
                            "بندہِ حق رہو اور بندہِ بیدار رہو",
                            "گر رواں باشی بہ سیلِ اشکِ خونی در کربلا",
                            "پایدار باشی چو شہِ مظلوم کربلا"
                        ]
                    },
                    {
                        "type": "urdu_prose",
                        "text": "عصرِ عاشور کا منظر وہ تھا جس نے پہاڑوں کو بھی رلا دیا ہوگا۔ جب امام حسین علیہ السلام تنہا رہ گئے، بچوں کی چیخیں خاموش ہو چکی تھیں، ساتھیوں کے جسیمے زمین پر بکھرے پڑے تھے۔ لیکن اس حالت میں بھی آپ کے پائے استقلال میں ذرا برابر لغزش نہ آئی۔ آپ نے اللہ کی رضا میں سر تسلیم خم کیا۔ جب گھوڑے سے زمین پر آئے تو پہلے سجدہ میں گئے۔ سجدے کی حالت میں ہی شمر لعین کا وار آیا اور آپ کا سر مبارک جسم سے جدا ہو گیا۔ لیکن آواز آئی: 'اللھم تقبل منی ہذا القربان'۔ یعنی اے اللہ! میری اس قربانی کو قبول فرما۔ یہ تھی حسینیت کا معیار کہ موت کے وقت بھی خالق سے راز و نیاز جاری تھا۔ سجدہ خالق میں سر کٹا دیا، لیکن رب کی محبت میں کوئی فرق نہ آیا۔"
                    },
                    {
                        "type": "urdu_prose",
                        "text": "آج بھی جب محرم المحرّم کا چاند طلوع ہوتا ہے اور غمِ حسین علیہ السلام منایا جاتا ہے، تو آنکھوں سے اشک جاری ہو جاتے ہیں۔ یہ آنسو محض رونے دھونے کے لیے نہیں ہیں۔ یہ آنسو محبت اور عقیدت کا اظہار ہیں۔ یہ آنسو اس عہد کی تجدید ہیں کہ ہم حسینی ہیں، ظلم کے خلاف ہمیشہ ڈٹ جائیں گے، حق کی حمایت میں ہمیشہ کھڑے رہیں گے۔ یہ آنسو دراصل ایک تحریک ہیں، ایک احتجاج ہیں، ایک عہد ہیں۔ جس طرح پانی سے پودے سیراب ہوتے ہیں، اسی طرح ان آنسوؤں سے حسینیت کا پودا سیراب ہوتا ہے۔ یہی وجہ ہے کہ چودہ سو سال گزرنے کے بعد بھی یہ تحریک زندہ ہے اور قیامت تک زندہ رہے گی۔"
                    },
                    {
                        "type": "arabic_quote",
                        "text": "كُلُّ يَوْمٍ عَاشُورَاء وَكُلُّ أَرْضٍ كَرْبَلَاء",
                        "reference": "قولِ مشہور"
                    },
                    {
                        "type": "urdu_prose",
                        "text": "امام حسین علیہ السلام کی اس عظیم قربانی نے نہ صرف اسلام کو قیامت تک کے لیے زندہ کر دیا، بلکہ انسانیت کو ایک نئی سمت بھی عطا کی۔ یزیدیت مٹ گئی، اس کا نام و نشان مٹ گیا، لیکن حسینیت آج بھی زندہ ہے اور ہمیشہ زندہ رہے گی۔ یہ قربانی ثابت کرتی ہے کہ حق ہمیشہ غالب آتا ہے، اگرچہ اس کے لیے قربانی دینا پڑے۔ آج پوری دنیا میں جہاں کہیں بھی ظلم ہو رہا ہے، مظلوم کو حسین یاد آتے ہیں اور ظالم کو یزید۔ یہی کربلا کی ابدی درس ہے کہ ہر زمانے میں، ہر جگہ پر، حق و باطل کا معرکہ جاری رہے گا، اور ہر صاحب ایمان کا فرض ہے کہ وہ حق کے ساتھ کھڑا ہو، چاہے اسے تنہا ہی کیوں نہ ہونا پڑے۔"
                    }
                ]
            },
            {
                "chapterId": 2,
                "title_ur": "وفائے عباسؑ",
                "content": [
                    {
                        "type": "urdu_prose",
                        "text": "حضرت عباس علیہ السلام کی وفا محض ایک تاریخی واقعہ نہیں، بلکہ وفا کی وہ معراج ہے جس تک پہنچنا ہر وفادار کے لیے ممکن نہیں۔ آپ علیہ السلام علمدارِ کربلا تھے، لیکن اس سے بڑھ کر وہ باب الحوائج بھی تھے جن کی دعا قبول ہوتی ہے۔ نہر فرات پر قبضہ ہونے کے باوجود، جب آپ نے پانی حاصل کر لیا تو پیاسے بچوں کی یاد میں ایک قطرہ پانی بھی نہ پیا۔ یہ وفا کی ایسی مثال ہے جو دنیا کی تاریخ میں کہیں اور نہیں ملتی۔ آپ نے ثابت کیا کہ وفا صرف زندہ لوگوں سے نہیں ہوتی، بلکہ اصولوں سے، عقیدے سے، اور اپنے امام سے بھی ہوتی ہے۔ آپ کی شہادت بھی وفا ہی کا نتیجہ تھی۔ جب دونوں بازو کٹ گئے، علم گر گیا، لیکن آپ نے پیاسے بچوں کے لیے مشکیزہ نہ چھوڑا۔ یہی تھی عباسیت کی روح۔"
                    },
                    {
                        "type": "arabic_quote",
                        "text": "يَا نَفْسُ مِنْ بَعْدِ الْحُسَيْنِ هُونِي .. وَبَعْدَهُ لاَ كُنْتِ أَنْ تَكُونِي",
                        "reference": "حضرت عباس علیہ السلام"
                    },
                    {
                        "type": "urdu_prose",
                        "text": "حضرت عباس علیہ السلام نے علمبرداری کا حق اس طرح ادا کیا کہ آج پوری دنیا میں وفا کو عباس علیہ السلام کے نام سے پہچانا جاتا ہے۔ آپ کی بہادری اور شجاعت اتنی تھی کہ لشکر یزید کے دل میں ہیبت طاری ہو گئی تھی۔ ایک روایت کے مطابق، جب آپ میدان میں آئے تو دشمن کی صفیں چیرتے ہوئے نہر فرات تک پہنچ گئے۔ لیکن آپ کا مقصد صرف پانی لینا نہیں تھا، بلکہ یہ ثابت کرنا تھا کہ اگر چاہیں تو پانی لے سکتے ہیں، لیکن بھائی کے بچوں کی پیاس یاد آتی ہے۔ آپ نے وہ مشکیزہ بھر کر لے آئے جس میں پیاسے بچوں کے لیے امید تھی۔ لیکن راستے میں شہادت نے آپ کو گھیر لیا۔ آپ کی شہادت نے کربلا کے واقعے کو اور بھی دردناک بنا دیا۔ آج بھی زائرین حضرت عباس علیہ السلام کے روضے پر آکر ان کی وفا کے قصے سنتے ہیں اور آنسو بہاتے ہیں۔"
                    }
                ]
            },
            {
                "chapterId": 3,
                "title_ur": "خواتینِ کربلا کا کردار",
                "content": [
                    {
                        "type": "urdu_prose",
                        "text": "کربلا میں خواتین کا کردار محض تماشائی کا نہیں تھا، بلکہ وہ اس تحریک کی روح تھیں۔ خصوصاً حضرت زینب سلام اللہ علیہا نے وہ کردار ادا کیا جس نے یزیدیت کی فتح کو شکست میں بدل دیا۔ کربلا کے بعد کوفہ و شام کے بازاروں اور درباروں میں آپ کے خطبات نے یزیدیت کے محلوں کو لرزا دیا۔ آپ نے اپنے نانا رسول اللہ صلی اللہ علیہ وآلہ وسلم اور بابا امیر المؤمنین علیہ السلام کے لہجے میں جو کلمات ادا کیے، انہوں نے یزید کے ظلم کو بے نقاب کر دیا۔ آپ نے کوفہ کے بازار میں کھڑے ہو کر فرمایا: 'اے کوفہ والو! تم نے ہمارے مردوں کو قتل کیا، ہماری عورتوں کو اسیر کیا، لیکن یاد رکھو، یہ ظلم کبھی بھی ہمارے مقصد کو ختم نہیں کر سکتا۔' یزید کے دربار میں آپ کا خطبہ تاریخ کا وہ روشن باب ہے جس میں آپ نے یزید کو اس کے انجام سے آگاہ کیا۔ آپ نے فرمایا: 'تم سمجھتے ہو کہ ہم پر فتح پا گئے ہو، لیکن حقیقت یہ ہے کہ ہم نے اپنا مقصد پا لیا ہے۔' یہی وہ کردار تھا جس نے کربلا کے پیغام کو دنیا تک پہنچایا۔"
                    },
                    {
                        "type": "persian_poetry",
                        "lines": [
                            "کربلا در کربلا می ماند اگر زینب نبود",
                            "شیعہ می پژمرد اگر زینب نبود",
                            "او کہ بعد از کشتہ شد تنہا پناهی داشت",
                            "کربلا را زینبِ غمخوارہ بود"
                        ]
                    }
                ]
            }
        ]
    },
    {
        "bookId": "seerat-e-nabawi",
        "title_ur": "سیرتِ نبویﷺ",
        "title_en": "Biography of the Prophet (PBUH)",
        "author_ur": "مفتی سجاد",
        "author_en": "Mufti Sajjad",
        "cover_style": "teal-silver",
        "total_chapters": 12,
        "chapters": [
            {
                "chapterId": 1,
                "title_ur": "بعثت اور ابتدائی تبلیغ",
                "content": [
                    {
                        "type": "urdu_prose",
                        "text": "نبی کریم صلی اللہ علیہ وآلہ وسلم کی بعثت محض ایک مذہبی واقعہ نہیں، بلکہ انسانیت کی تاریخ کا وہ عظیم ترین موڑ ہے جس نے تاریک دنیا میں روشنی کی کرن پھیلائی۔ آپ کی آمد سے قبل عرب معاشرہ جہالت، بت پرستی، ظلم اور برائیوں میں ڈوبا ہوا تھا۔ عورت کو زندہ درگور کر دیا جاتا تھا، قبیلے آپس میں لڑتے رہتے تھے، اور انسانیت کا کوئی احترام نہ تھا۔ ایسے میں اللہ تعالیٰ نے اپنے آخری نبی محمد مصطفیٰ صلی اللہ علیہ وآلہ وسلم کو مبعوث فرمایا۔ غار حرا میں پہلی وحی نازل ہوئی: 'اقرأ باسم ربك الذي خلق'۔ یہ وہ تاریخی لمحہ تھا جس نے دنیا کی تقدیر بدل دی۔ آپ نے ابتداء میں خفیہ طور پر تبلیغ شروع کی۔ حضرت خدیجہ سلام اللہ علیہا، حضرت علی علیہ السلام، اور حضرت ابوبکر رضی اللہ عنہ سب سے پہلے ایمان لائے۔ پھر آپ نے کوہ صفا پر چڑھ کر کھلے عام دعوت دی۔ قریش کے سرداروں نے سخت مخالفت کی، مگر آپ ڈٹے رہے۔"
                    },
                    {
                        "type": "arabic_quote",
                        "text": "وَمَا أَرْسَلْنَاكَ إِلَّا رَحْمَةً لِلْعَالَمِينَ",
                        "reference": "القرآن 21:107"
                    },
                    {
                        "type": "urdu_prose",
                        "text": "نبی کریم صلی اللہ علیہ وآلہ وسلم پر قریش نے طرح طرح کے مظالم ڈھائے۔ آپ پر گندگی پھینکی گئی، آپ کے راستے میں کانٹے بچھائے گئے، آپ کو قتل کی دھمکیاں دی گئیں۔ لیکن آپ نے ہر ظلم کو صبر کے ساتھ برداشت کیا۔ طائف کا واقعہ تو صبر کی انتہا تھی۔ آپ طائف گئے تاکہ وہاں کے لوگوں کو اسلام کی دعوت دیں، مگر انہوں نے نہ صرف انکار کیا بلکہ اپنے لونڈوں اور غلاموں کو حکم دیا کہ آپ کو پتھروں سے مارو۔ آپ کا جسم مبارک زخمی ہو گیا، جوتوں میں خون بھر گیا، لیکن آپ کے لبوں پر شکوہ نہیں بلکہ دعا تھی: 'اللهم اغفر لقومی فإنهم لا يعلمون'۔ یعنی اے اللہ! میری قوم کو معاف فرما دے، بے شک وہ نہیں جانتے۔ یہ تھا آپ کا اخلاق، یہ تھی آپ کی رحمت۔ اسی رحمت کی وجہ سے آپ رحمت للعالمین کہلائے۔"
                    }
                ]
            },
            {
                "chapterId": 2,
                "title_ur": "ہجرتِ مدینہ",
                "content": [
                    {
                        "type": "urdu_prose",
                        "text": "مکہ مکرمہ میں تیرہ سال تک جاری رہنے والی تکالیف اور مظالم کے بعد اللہ تعالیٰ کے حکم سے نبی کریم صلی اللہ علیہ وآلہ وسلم نے مدینہ منورہ کی طرف ہجرت فرمائی۔ یہ ہجرت محض ایک جگہ سے دوسری جگہ جانا نہیں تھی، بلکہ یہ اسلام کی تاریخ کا وہ اہم ترین موڑ تھا جس نے اسلام کو ایک منظم ریاست کی شکل دی۔ ہجرت سے قبل مکہ میں مسلمان اقلیت میں تھے اور ظلم سہہ رہے تھے، لیکن مدینہ میں آپ نے پہلی اسلامی ریاست کی بنیاد رکھی۔ یہاں آپ نے مسجد قبا تعمیر کی، پھر مسجد نبوی کی بنیاد رکھی۔ آپ نے مہاجرین و انصار کے درمیان مؤاخات قائم کیا، یعنی ہر انصاری نے ایک مہاجر کو اپنا بھائی بنا لیا۔ آپ نے مدینہ کے یہود اور دیگر قبائل کے ساتھ میثاق مدینہ لکھوایا، جو دراصل دنیا کا پہلا تحریری آئین تھا۔ ہجرت نے مسلمانوں کو نہ صرف سیاسی طاقت دی، بلکہ انہیں تبلیغ اسلام کے لیے ایک محفوظ مرکز بھی فراہم کیا۔"
                    },
                    {
                        "type": "persian_poetry",
                        "lines": [
                            "محمدؐ شمعِ بزمِ آفرینش",
                            "چراغِ راہِ دنیا و دینش",
                            "ہر کہ شد مدحتِ او گویا و دانا",
                            "شد بہ فردوسِ بریں جاودانا"
                        ]
                    }
                ]
            }
        ]
    },
    {
        "bookId": "nahjul-balagha-selections",
        "title_ur": "منتخب نہج البلاغہ",
        "title_en": "Selections from Nahj al-Balagha",
        "author_ur": "ترجمہ و تشریح: مفتی سجاد",
        "author_en": "Trans: Mufti Sajjad",
        "cover_style": "dark-gold",
        "total_chapters": 8,
        "chapters": [
            {
                "chapterId": 1,
                "title_ur": "تقویٰ کی اہمیت",
                "content": [
                    {
                        "type": "urdu_prose",
                        "text": "مولائے کائنات حضرت علی علیہ السلام کے کلمات جو نہج البلاغہ میں محفوظ ہیں، انسانی فکر کے شاہکار ہیں۔ تقویٰ کے بارے میں آپ کے ارشادات نہ صرف گہرے فلسفیانہ مضامین رکھتے ہیں، بلکہ عملی زندگی کے لیے بھی رہنمائی فراہم کرتے ہیں۔ آپ نے فرمایا کہ تقویٰ انسان کو گناہوں کی تاریک دلدل سے نکال کر نیکیوں کی بلندیوں تک لے جاتا ہے۔ تقویٰ محض نماز روزے کا نام نہیں، بلکہ یہ ایک جامع تصور ہے جس میں اللہ کی ہر وقت حاضر و ناظر سمجھنا، حرام سے بچنا، حلال پر قناعت کرنا، اور دوسروں کے حقوق کی ادائیگی شامل ہے۔ آپ نے تقویٰ کو زمام اور قوام قرار دیا، یعنی یہ وہ لگام ہے جو انسان کو گمراہی سے روکتی ہے اور وہ ستون ہے جو انسان کی شخصیت کو استحکام دیتا ہے۔ تقویٰ کے بغیر انسان کی تمام عبادتیں بے روح ہیں، تمام اعمال بے نتیجہ ہیں۔ یہی وجہ ہے کہ قرآن میں متعدد مقامات پر تقویٰ کی تاکید کی گئی ہے اور حضرت علی علیہ السلام نے اس کی عملی تفسیر پیش کی۔"
                    },
                    {
                        "type": "arabic_quote",
                        "text": "أُوصِيكُمْ عِبَادَ اَللَّهِ بِتَقْوَى اَللَّهِ فَإِنَّهَا اَلزِّمَامُ وَ اَلْقِوَامُ",
                        "reference": "نہج البلاغہ"
                    }
                ]
            },
            {
                "chapterId": 2,
                "title_ur": "دنیا کی حقیقت",
                "content": [
                    {
                        "type": "urdu_prose",
                        "text": "حضرت علی علیہ السلام نے دنیا کی بے ثباتی اور فانی ہونے کو ایسے بیان فرمایا ہے کہ پڑھنے والا دنیا کی محبت سے بے زار ہو جاتا ہے۔ آپ فرماتے ہیں کہ دنیا ایک گزرگاہ ہے، قرار گاہ نہیں۔ یہاں سے ہر مسافر کو گذرنا ہے۔ عقلمند وہ ہے جو اس گزرگاہ سے اپنی آخرت کے لیے زاد راہ جمع کرے۔ آپ نے دنیا کو ایک دھوکے باز سوداگر سے تشبیہ دی ہے جو پہلے دیتی دکھاتی ہے، پھر چھین لیتی ہے۔ آپ کا ارشاد ہے: 'دنیا کی مثال سمندر کی طرح ہے جس کا پانی میٹھا لگتا ہے، لیکن جو زیادہ پیتا ہے وہ ہلاک ہو جاتا ہے۔' آپ نے دنیا داروں کو تنبیہ کی کہ دنیا کی محبت انسان کو اندھا بہرا کر دیتی ہے۔ انسان دولت، شہرت، اور عہدوں کے پیچھے بھاگتا ہے، لیکن موت کے وقت ہاتھ کچھ نہیں آتا۔ آپ نے فرمایا: 'تم دنیا سے اس طرح محبت کرو جیسے مسافر راستے میں کسی جگہ قیام کرے، صبح ہوتے ہی کوچ کر جائے۔' یہی فلسفہ ہے جو انسان کو دنیا کی محبت میں گرفتار ہونے سے بچاتا ہے۔"
                    },
                    {
                        "type": "persian_poetry",
                        "lines": [
                            "اے کہ در دنیا نظر داری، ہشیار باش",
                            "غافل مشو، دائم بیدار باش",
                            "یہ گلستانِ جہان یک دمہ نپاید",
                            "برگ و بارش را چمن سے رخت بربند"
                        ]
                    }
                ]
            }
        ]
    },
    {
        "bookId": "tafsir-e-namona",
        "title_ur": "تفسیرِ نمونہ (منتخب)",
        "title_en": "Tafsir-e-Namona (Selected)",
        "author_ur": "آیت اللہ مکارم شیرازی (مترجم: مفتی سجاد)",
        "author_en": "Ayatullah Makarim Shirazi",
        "cover_style": "blue-silver",
        "total_chapters": 30,
        "chapters": [
            {
                "chapterId": 1,
                "title_ur": "سورہ فاتحہ کی تفسیر",
                "content": [
                    {
                        "type": "urdu_prose",
                        "text": "سورہ فاتحہ کو ام الکتاب کہا جاتا ہے، کیونکہ یہ قرآن مجید کا خلاصہ اور مرکزی موضوعات کا احاطہ کرتی ہے۔ اس کی سات آیات میں توحید، ربوبیت، رحمانیت، یوم آخرت، عبادت، استعانت اور ہدایت کا مکمل پروگرام موجود ہے۔ 'بسم اللہ الرحمن الرحیم' سے آغاز ہوتا ہے جو ہر کام کی برکت اور رحمت کا ذریعہ ہے۔ پھر 'الحمد للہ رب العالمین' میں اللہ کی حمد و ثنا ہے کہ وہ تمام جہانوں کا پروردگار ہے۔ 'الرحمن الرحیم' میں اس کی رحمت کی وسعت کا بیان ہے۔ 'مالک یوم الدین' میں آخرت پر ایمان اور جزا و سزا کا عقیدہ ہے۔ پھر 'ایاک نعبد و ایاک نستعین' میں عبادت کی حقیقت ہے کہ ہم صرف تیری ہی عبادت کرتے ہیں اور تجھ ہی سے مدد چاہتے ہیں۔ 'اھدنا الصراط المستقیم' میں ہدایت کی دعا ہے۔ اور آخر میں ان لوگوں سے اختلاف کا اظہار ہے جو غضب اور گمراہی میں ہیں۔ یہ سورت نماز کا لازمی حصہ ہے، جس سے معلوم ہوتا ہے کہ انسان کو ہر نماز میں اللہ سے اپنے تعلق کی تجدید کرنی چاہیے۔"
                    },
                    {
                        "type": "arabic_quote",
                        "text": "الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ",
                        "reference": "القرآن 1:2"
                    }
                ]
            }
        ]
    },
    {
        "bookId": "tareekh-e-islam",
        "title_ur": "تاریخِ اسلام کے درخشاں باب",
        "title_en": "Bright Chapters of Islamic History",
        "author_ur": "مفتی سجاد",
        "author_en": "Mufti Sajjad",
        "cover_style": "green-gold",
        "total_chapters": 15,
        "chapters": [
            {
                "chapterId": 1,
                "title_ur": "فتحِ مکہ",
                "content": [
                    {
                        "type": "urdu_prose",
                        "text": "فتح مکہ اسلام کی تاریخ کا وہ سنہری باب ہے جب نبی کریم صلی اللہ علیہ وآلہ وسلم بغیر کسی خونریزی کے مکہ میں داخل ہوئے اور کفار مکہ کو عام معافی دے دی۔ یہ واقعہ 8 ہجری میں پیش آیا جب قریش نے حدیبیہ کا معاہدہ توڑ دیا۔ نبی کریم صلی اللہ علیہ وآلہ وسلم دس ہزار صحابہ کے ساتھ مکہ کی طرف روانہ ہوئے۔ آپ نے حکم دیا کہ کسی پر حملہ نہ کیا جائے، سوائے ان چند افراد کے جنہوں نے خاص جرائم کیے تھے۔ مکہ فتح ہو گیا، اور کفار ڈر رہے تھے کہ اب ان کا کیا حشر ہوگا۔ لیکن نبی کریم صلی اللہ علیہ وآلہ وسلم نے کہا: 'تم سب آزاد ہو، تم پر کوئی گرفت نہیں۔' یہ عفو و درگزر کی ایسی مثال تھی جس نے دشمنوں کے دل جیت لیے۔ اسی دن آپ نے کعبہ میں موجود تمام بتوں کو توڑ دیا اور اللہ کی توحید کا اعلان کیا۔ فتح مکہ دراصل اسلام کی روحانی فتح تھی، جس نے ثابت کیا کہ محبت اور معافی، نفرت اور انتقام سے زیادہ طاقتور ہوتی ہے۔"
                    },
                    {
                        "type": "arabic_quote",
                        "text": "اذْهَبُوا فَأَنْتُمُ الطُّلَقَاءُ",
                        "reference": "حدیث نبویﷺ"
                    }
                ]
            }
        ]
    },
    {
        "bookId": "islamic-ethics",
        "title_ur": "اخلاقِ اسلامی",
        "title_en": "Islamic Ethics",
        "author_ur": "مفتی سجاد",
        "author_en": "Mufti Sajjad",
        "cover_style": "purple-gold",
        "total_chapters": 10,
        "chapters": [
            {
                "chapterId": 1,
                "title_ur": "صدق و امانت",
                "content": [
                    {
                        "type": "urdu_prose",
                        "text": "اسلامی اخلاقیات کی بنیاد دو ستونوں پر قائم ہے: صدق (سچائی) اور امانت (ایمانت داری)۔ نبی کریم صلی اللہ علیہ وآلہ وسلم کی بعثت سے قبل آپ کو 'الصادق الامین' کے لقب سے پکارا جاتا تھا، جو آپ کے بلند اخلاق کی واضح دلیل ہے۔ صدق محض زبان سے سچ بولنے کا نام نہیں، بلکہ یہ ایک جامع تصور ہے جس میں قول، فعل، اور نیت کی سچائی شامل ہے۔ امانت کا دائرہ بھی وسیع ہے: اللہ کی امانت یعنی دین کی حفاظت، والدین کی امانت یعنی اولاد کی تربیت، معاشرے کی امانت یعنی لوگوں کے حقوق کی ادائیگی، اور خود انسان کی امانت یعنی اس کے جسم و روح کی حفاظت۔ اسلامی تاریخ میں حضرت علی علیہ السلام کا واقعہ مشہور ہے کہ جب آپ نے کافر کے ہاتھ میں امانت واپس کی، حالانکہ وہ دشمن تھا۔ یہ تھا امانت کا اسلامی معیار۔ آج کے معاشرے میں جہاں دھوکہ دہی، فریب اور بددیانتی عام ہے، اسلامی اخلاقیات ہی انسانیت کو بچا سکتی ہیں۔"
                    },
                    {
                        "type": "arabic_quote",
                        "text": "إِنَّ اللَّهَ يَأْمُرُكُمْ أَنْ تُؤَدُّوا الْأَمَانَاتِ إِلَى أَهْلِهَا",
                        "reference": "القرآن 4:58"
                    }
                ]
            },
            {
                "chapterId": 2,
                "title_ur": "تواضع و انکساری",
                "content": [
                    {
                        "type": "urdu_prose",
                        "text": "تواضع اور انکساری اسلامی اخلاق کا اہم ترین پہلو ہے۔ نبی کریم صلی اللہ علیہ وآلہ وسلم دنیا کے سب سے بڑے انسان تھے، لیکن آپ کا اخلاق اس قدر بلند تھا کہ آپ غلاموں کے ساتھ بیٹھ کر کھاتے، مسکینوں کی مدد کرتے، اور اپنے کام خود کرتے۔ آپ نے فرمایا: 'تواضع ایمان کا حصہ ہے۔' تواضع کا مطلب یہ نہیں کہ انسان اپنی ذات کو کمتر سمجھے، بلکہ یہ کہ وہ اپنی خوبیوں پر فخر نہ کرے اور دوسروں کو حقیر نہ جانے۔ حضرت علی علیہ السلام نے فرمایا: 'تواضع وہ زیور ہے جو انسان کو بلندی عطا کرتا ہے۔' تاریخ اسلام میں حضرت عمر رضی اللہ عنہ کا واقعہ مشہور ہے کہ وہ راتوں میں مدینہ کے گرد گشت کرتے اور محتاجوں کی مدد کرتے۔ یہی تواضع تھی جس نے اسلامی حکومت کو عوام کی محبت حاصل کی۔ آج کے دور میں جب تکبر، غرور اور خودپسندی عام ہے، اسلامی تعلیمات ہمیں سکھاتی ہیں کہ حقیقی عزت تواضع میں ہے۔"
                    },
                    {
                        "type": "persian_poetry",
                        "lines": [
                            "تواضع کن تا بلندت کند خدا",
                            "کہ خوار دارد تکبر را خدا",
                            "بہ زیرکی مہرِ دانش می زند",
                            "نہ در کلوخے نشان می زند"
                        ]
                    }
                ]
            }
        ]
    },
    {
        "bookId": "miracles-of-quran",
        "title_ur": "معجزاتِ قرآن",
        "title_en": "Miracles of the Quran",
        "author_ur": "مفتی سجاد",
        "author_en": "Mufti Sajjad",
        "cover_style": "crimson-gold",
        "total_chapters": 8,
        "chapters": [
            {
                "chapterId": 1,
                "title_ur": "سائنسی معجزات",
                "content": [
                    {
                        "type": "urdu_prose",
                        "text": "قرآن مجید محض ایک مذہبی کتاب نہیں، بلکہ یہ سائنسی حقائق کا بھی خزانہ ہے۔ چودہ سو سال قبل جب سائنس کی کوئی ترقی نہیں ہوئی تھی، قرآن نے ایسے حقائق بیان کیے جو آج جدید سائنس نے ثابت کیے ہیں۔ مثلاً قرآن میں ارشاد ہے: 'اور ہم نے ہر زندہ چیز کو پانی سے بنایا۔' (الانبیاء: 30) آج سائنس ثابت کرتی ہے کہ ہر جاندار کا بنیادی جزو پانی ہے۔ اسی طرح قرآن میں کہا گیا: 'اور ہم نے آسمانوں کو طاقت کے ساتھ بنایا، اور ہم وسعت دینے والے ہیں۔' (الذاریات: 47) جدید فلکیات نے ثابت کیا ہے کہ کائنات مسلسل پھیل رہی ہے۔ قرآن میں پہاڑوں کے بارے میں کہا گیا کہ وہ میخیں ہیں جو زمین کو ٹکائے ہوئے ہیں۔ (النبأ: 7) آج پلیٹ ٹیکٹانکس کے نظریے سے معلوم ہوا ہے کہ پہاڑ زمین کی پرتوں کو stable رکھتے ہیں۔ یہ سب معجزات اس بات کی دلیل ہیں کہ قرآن اللہ کا کلام ہے، جس نے آج کے سائنسی دور کو چیلنج کر دیا ہے۔"
                    },
                    {
                        "type": "arabic_quote",
                        "text": "وَجَعَلْنَا مِنَ الْمَاءِ كُلَّ شَيْءٍ حَيٍّ",
                        "reference": "القرآن 21:30"
                    }
                ]
            },
            {
                "chapterId": 2,
                "title_ur": "تاریخی پیشگوئیاں",
                "content": [
                    {
                        "type": "urdu_prose",
                        "text": "قرآن مجید میں متعدد تاریخی پیشگوئیاں موجود ہیں جو بعد میں حرف بحرف پوری ہوئیں۔ مثلاً سورہ الروم میں فرمایا گیا: 'رومی مغلوب ہو گئے قریب کی زمین میں، اور وہ اپنی مغلوبیت کے بعد جلد ہی غالب آ جائیں گے۔' (الروم: 2-4) جب یہ آیت نازل ہوئی، اس وقت رومی سلطنت ایران سے جنگ ہار چکی تھی اور مسلمان اس پر غمگین تھے۔ لیکن قرآن نے پیشگوئی کی کہ رومی تین سے نوسال کے اندر فتح پا جائیں گے۔ اور ایسا ہی ہوا، 624 عیسوی میں رومیوں نے ایرانیوں کو شکست دی۔ اسی طرح قرآن نے فرمایا کہ ابولہب اور اس کی بیوی جہنم میں جائیں گے۔ (سورہ المسد) یہ پیشگوئی بھی پوری ہوئی۔ یہ تاریخی پیشگوئیاں ثابت کرتی ہیں کہ قرآن محض انسانی فکر کا نتیجہ نہیں، بلکہ غیب کی خبریں دینے والی کتاب ہے۔ یہی وجہ ہے کہ چودہ صدیاں گزرنے کے بعد بھی قرآن کا چیلنج قائم ہے کہ کوئی اس جیسی ایک سورت بنا لائے۔"
                    },
                    {
                        "type": "persian_poetry",
                        "lines": [
                            "قرآن کتابِ ہدایت است و نور",
                            "ہر حرفِ او از جمالِ ذاتِ غیور",
                            "پیشگوئی ہا کہ در او آمده",
                            "بر صحتِ او همه گواہ آمده"
                        ]
                    }
                ]
            }
        ]
    }
]